app/controllers/products_controller.rb

INSERT INTO "products" ("name", "description", "inventory", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    Product.create(product_params)